XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2A41A_DFP.pdsc
    <condition id="allOf.device_id=K32L2A41xxxxA, driver.dmamux, driver.edma.internal_condition">
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.K32L2A41A.internal_condition">
      <accept Dname="K32L2A41VLH1A" Dvendor="NXP:11"/>
      <accept Dname="K32L2A41VLL1A" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.device=K32L2A41A.internal_condition">
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.driver.common, component.timer_manager, anyOf=component.gpio_adapter, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.timer_manager, anyOf=component.gpio_adapter, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="anyOf.component.gpio_adapter.internal_condition"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="anyOf.component.gpio_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="gpio_adapter"/>
    </condition>
    <condition id="component.crc_adapter.condition_id">
      <require condition="allOf.driver.common, driver.crc, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.crc, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="crc"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.eeprom_InternalFlash.condition_id">
      <require condition="allOf.driver.common, component.flash_adapter, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.flash_adapter, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash_adapter"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.flash_adapter.condition_id">
      <require condition="allOf.driver.common, driver.flash, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flash, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.gpio_adapter.condition_id">
      <require condition="allOf.driver.gpio, anyOf=driver.port, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.gpio, anyOf=driver.port, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="anyOf.driver.port.internal_condition"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.port.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
    </condition>
    <condition id="component.led.condition_id">
      <require condition="allOf.driver.common, component.timer_manager, anyOf=component.gpio_adapter, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debugconsole.condition_id">
      <require condition="allOf.driver.common, component.log, utility.debug_console, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, utility.debug_console, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debugconsole_lite.condition_id">
      <require condition="allOf.driver.common, component.log, utility.debug_console_lite, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, utility.debug_console_lite, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.driver.common, component.log, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
