XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2A41A_DFP.pdsc
    <condition id="component.lpi2c_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpi2c, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lpi2c, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.lpit_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpit, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lpit, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpit"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.lpit_time_stamp_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpit, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.lpspi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpspi, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lpspi, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.lptmr_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lptmr, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lptmr, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.lptmr_time_stamp_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lptmr, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.lpuart_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpuart, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lpuart, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.lpuart_dma_adapter.condition_id">
      <require condition="allOf.component.lpuart_adapter, component.timer_manager, anyOf=driver.lpuart_edma, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, component.timer_manager, anyOf=driver.lpuart_edma, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="anyOf.driver.lpuart_edma.internal_condition"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart_edma.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
    </condition>
    <condition id="component.mem_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.driver.common, component.lists, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.messaging.condition_id">
      <require condition="allOf.driver.common, component.lists, component.mem_manager_light, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, component.mem_manager_light, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.driver.common, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.pwm_tpm_adapter.condition_id">
      <require condition="allOf.driver.common, driver.tpm, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.tpm, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tpm"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.driver.common, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.rtc.condition_id">
      <require condition="allOf.driver.common, driver.rtc, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.rtc, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtc"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="component.scrambler.condition_id">
      <require condition="allOf.driver.common, device=K32L2A41A.internal_condition"/>
    </condition>
