XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2A41A_DFP.pdsc
    <condition id="device_ids.K32L2A41xxxxA.internal_condition">
      <accept Dname="K32L2A41VLH1A" Dvendor="NXP:11"/>
      <accept Dname="K32L2A41VLL1A" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=K32L2A41xxxxA.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=K32L2A41xxxxA.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=K32L2A41xxxxA.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.K32L2A41A_startup.condition_id">
      <require condition="allOf.device.K32L2A41A_system, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.device.K32L2A41A_system, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L2A41A_system"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.K32L2A41A_system.condition_id">
      <require condition="allOf.device.K32L2A41A_CMSIS, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.device.K32L2A41A_CMSIS, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L2A41A_header"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.adc16.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition">
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.driver.common, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.cmp.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpi2c.condition_id">
      <require condition="allOf.driver.lpi2c_edma, device_id=K32L2A41xxxxA, driver.lpi2c, CMSIS_Driver_Include.I2C, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpi2c_edma, device_id=K32L2A41xxxxA, driver.lpi2c, CMSIS_Driver_Include.I2C, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.driver.lpspi_edma, device_id=K32L2A41xxxxA, driver.lpspi, CMSIS_Driver_Include.SPI, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi_edma, device_id=K32L2A41xxxxA, driver.lpspi, CMSIS_Driver_Include.SPI, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.driver.lpuart_edma, device_id=K32L2A41xxxxA, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart_edma, device_id=K32L2A41xxxxA, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.driver.clock, device.K32L2A41A_CMSIS, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.clock, device.K32L2A41A_CMSIS, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L2A41A_header"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm0p.condition_id">
      <require condition="cores.cm0p.internal_condition"/>
    </condition>
    <condition id="cores.cm0p.internal_condition">
      <accept Dcore="Cortex-M0+"/>
    </condition>
    <condition id="driver.crc.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
