XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2A41A_DFP.pdsc
    <condition id="driver.dac.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.edma.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common, driver.dmamux.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L2A41xxxxA, driver.common, driver.dmamux.internal_condition">
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="driver.flash.condition_id">
      <require condition="allOf.driver.common, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flexio_camera.condition_id">
      <require condition="allOf.driver.flexio, device_id=K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=K32L2A41xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.flexio_camera_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_camera, device_id=K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_camera, device_id=K32L2A41xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_camera"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device=K32L2A41A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_i2s, device_id=K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_i2s, device_id=K32L2A41xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd.condition_id">
      <require condition="allOf.driver.flexio, device_id=K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_mculcd, device_id=K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_mculcd, device_id=K32L2A41xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_spi, device_id=K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_spi, device_id=K32L2A41xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_uart, device_id=K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_uart, device_id=K32L2A41xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.driver.common, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=K32L2A41A.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.driver.common, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.gpio.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.intmux.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.llwu.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
