XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2A41A_DFP.pdsc
    <condition id="driver.lpi2c_edma.condition_id">
      <require condition="allOf.driver.edma, driver.lpi2c, device_id=K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.lpi2c, device_id=K32L2A41xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.lpit.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpspi.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpspi_edma.condition_id">
      <require condition="allOf.driver.edma, driver.lpspi, device_id=K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.lpspi, device_id=K32L2A41xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_edma.condition_id">
      <require condition="allOf.driver.edma, driver.lpuart, device_id=K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.lpuart, device_id=K32L2A41xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.driver.common, device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.mmdvsq.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.device=K32L2A41A.internal_condition"/>
    </condition>
    <condition id="driver.pmc.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.port.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.rcm.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.rtc.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.sim.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_emvsim.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, anyOf=device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L2A41xxxxA, anyOf=device_id=K32L2A41xxxxA, driver.common.internal_condition">
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
      <require condition="anyOf.device_id=K32L2A41xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="anyOf.device_id=K32L2A41xxxxA.internal_condition">
      <accept condition="device_id.K32L2A41xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_phy_emvsim.condition_id">
      <require condition="allOf.driver.smartcard_emvsim, device_id=K32L2A41xxxxA, anyOf=device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.driver.smartcard_emvsim, device_id=K32L2A41xxxxA, anyOf=device_id=K32L2A41xxxxA, driver.common.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_emvsim"/>
      <require condition="device_id.K32L2A41xxxxA.internal_condition"/>
      <require condition="anyOf.device_id=K32L2A41xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.smc.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.tpm.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.trgmux.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.trng.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.tsi_v4.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.tstmr.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.vref.condition_id">
      <require condition="allOf.device_id=K32L2A41xxxxA, driver.common.internal_condition"/>
    </condition>
