XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2A41A_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter" Cversion="1.0.0" condition="component.trng_adapter.condition_id">
      <description>Component trng_adapter</description>
      <files>
        <file category="header" name="components/rng/fsl_adapter_rng.h" projectpath="component/rng"/>
        <file category="sourceC" name="components/rng/fsl_adapter_trng.c" projectpath="component/rng"/>
        <file category="include" name="components/rng/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="K32L2A41A_header" Cversion="1.0.0" condition="device.K32L2A41A_CMSIS.condition_id">
      <description>Device K32L2A41A_cmsis</description>
      <files>
        <file category="header" name="devices/K32L2A41A/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/K32L2A41A/K32L2A41A.h" projectpath="device"/>
        <file category="header" name="devices/K32L2A41A/K32L2A41A_features.h" projectpath="device"/>
        <file category="include" name="devices/K32L2A41A/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="K32L2A41A_linker" Cversion="1.0.0" condition="device.K32L2A41A_linker.condition_id">
      <description>Device K32L2A41A_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=K32L2A41xxxxA.condition_id" category="linkerScript" attr="config" name="devices/K32L2A41A/arm/K32L2A41xxxxA_flash.scf" version="1.0.0" projectpath="K32L2A41A/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=K32L2A41xxxxA.condition_id" category="linkerScript" attr="config" name="devices/K32L2A41A/arm/K32L2A41xxxxA_ram.scf" version="1.0.0" projectpath="K32L2A41A/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=K32L2A41xxxxA.condition_id" category="linkerScript" attr="config" name="devices/K32L2A41A/gcc/K32L2A41xxxxA_flash.ld" version="1.0.0" projectpath="K32L2A41A/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=K32L2A41xxxxA.condition_id" category="linkerScript" attr="config" name="devices/K32L2A41A/gcc/K32L2A41xxxxA_ram.ld" version="1.0.0" projectpath="K32L2A41A/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=K32L2A41xxxxA.condition_id" category="linkerScript" attr="config" name="devices/K32L2A41A/iar/K32L2A41xxxxA_flash.icf" version="1.0.0" projectpath="K32L2A41A/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=K32L2A41xxxxA.condition_id" category="linkerScript" attr="config" name="devices/K32L2A41A/iar/K32L2A41xxxxA_ram.icf" version="1.0.0" projectpath="K32L2A41A/iar"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.1.0" condition="device.K32L2A41A_startup.condition_id">
      <description>Device K32L2A41A_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/K32L2A41A/iar/startup_K32L2A41A.s" version="1.1.0" projectpath="startup"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/K32L2A41A/gcc/startup_K32L2A41A.S" version="1.1.0" projectpath="startup"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/K32L2A41A/arm/startup_K32L2A41A.S" version="1.1.0" projectpath="startup"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="K32L2A41A_system" Cversion="1.0.0" condition="device.K32L2A41A_system.condition_id">
      <description>Device K32L2A41A_system</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/system_K32L2A41A.c" projectpath="device"/>
        <file category="header" name="devices/K32L2A41A/system_K32L2A41A.h" projectpath="device"/>
        <file category="include" name="devices/K32L2A41A/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.3.0" condition="driver.adc16.condition_id">
      <description>ADC16 Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_adc16.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_adc16.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.3.1" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp" Cversion="2.0.3" condition="driver.cmp.condition_id">
      <description>CMP Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_cmp.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_cmp.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="lpi2c_cmsis" Cversion="2.4.0" Capiversion="2.3.0" condition="driver.cmsis_lpi2c.condition_id">
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/cmsis_drivers/fsl_lpi2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/cmsis_drivers/fsl_lpi2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="lpspi_cmsis" Cversion="2.9.0" Capiversion="2.2.0" condition="driver.cmsis_lpspi.condition_id">
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/cmsis_drivers/fsl_lpspi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/cmsis_drivers/fsl_lpspi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.5.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.4.0" condition="driver.common.condition_id">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="sourceC" name="devices/K32L2A41A/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="header" name="devices/K32L2A41A/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="crc" Cversion="2.0.4" condition="driver.crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
