XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2A41A_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtc" Cversion="2.3.0" condition="driver.rtc.condition_id">
      <description>RTC Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_rtc.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_rtc.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sim" Cversion="2.1.3" condition="driver.sim.condition_id">
      <description>SIM Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_sim.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_sim.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_emvsim" Cversion="2.3.0" condition="driver.smartcard_emvsim.condition_id">
      <description>SMARTCARD EMVSIM Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_smartcard.h" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_smartcard_emvsim.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_smartcard_emvsim.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_phy_emvsim" Cversion="2.3.0" condition="driver.smartcard_phy_emvsim.condition_id">
      <description>SMARTCARD PHY EMVSIM, use only one SMARTCARD PHY in the project</description>
      <RTE_Components_h>
#ifndef USING_PHY_EMVSIM
#define USING_PHY_EMVSIM 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_smartcard_phy.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_smartcard_phy_emvsim.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smc" Cversion="2.0.7" condition="driver.smc.condition_id">
      <description>SMC Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_smc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_smc.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tpm" Cversion="2.2.3" condition="driver.tpm.condition_id">
      <description>TPM Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_tpm.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_tpm.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trgmux" Cversion="2.0.1" condition="driver.trgmux.condition_id">
      <description>TRGMUX Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_trgmux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_trgmux.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng" Cversion="2.0.15" condition="driver.trng.condition_id">
      <description>TRNG Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_trng.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_trng.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tsi_v4" Cversion="2.1.3" condition="driver.tsi_v4.condition_id">
      <description>TSI Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_tsi_v4.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_tsi_v4.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tstmr" Cversion="2.0.1" condition="driver.tstmr.condition_id">
      <description>TSTMR Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_tstmr.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="vref" Cversion="2.1.2" condition="driver.vref.condition_id">
      <description>VREF Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_vref.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_vref.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wdog" Cversion="2.1.0" condition="driver.wdog32.condition_id">
      <description>WDOG32 Driver</description>
      <files>
        <file category="header" name="devices/K32L2A41A/drivers/fsl_wdog32.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A41A/drivers/fsl_wdog32.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A41A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="baremetal" Cversion="1.0.0" condition="middleware.baremetal.condition_id">
      <description>Middleware baremetal</description>
      <RTE_Components_h>
#ifndef SDK_OS_BAREMETAL
#define SDK_OS_BAREMETAL 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="middleware/bm/readme.txt" projectpath="middleware/bm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="misc_utilities" Cversion="1.1.1" condition="utilities.misc_utilities.condition_id">
      <description>Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.</description>
      <files>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/K32L2A41A/utilities/fsl_sbrk.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/K32L2A41A/utilities/fsl_syscall_stub.c" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="utility.assert.condition_id">
      <description>Utility assert</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/utilities/fsl_assert.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2A41A/utilities/fsl_assert.h" projectpath="utilities"/>
        <file category="include" name="devices/K32L2A41A/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite" Cversion="1.0.0" condition="utility.assert_lite.condition_id">
      <description>Utility assert_lite</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/utilities/debug_console_lite/fsl_assert.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2A41A/utilities/debug_console_lite/fsl_assert.h" projectpath="utilities"/>
        <file category="include" name="devices/K32L2A41A/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console" Cversion="1.0.1" condition="utility.debug_console.condition_id">
      <description>Utility debug_console</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2A41A/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/K32L2A41A/utilities/debug_console/fsl_debug_console.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2A41A/utilities/debug_console/fsl_debug_console.h" projectpath="utilities"/>
        <file category="header" name="devices/K32L2A41A/utilities/debug_console/fsl_debug_console_conf.h" projectpath="utilities"/>
        <file category="include" name="devices/K32L2A41A/utilities/str/"/>
        <file category="include" name="devices/K32L2A41A/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite" Cversion="1.0.0" condition="utility.debug_console_lite.condition_id">
      <description>Utility debug_console_lite</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2A41A/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/K32L2A41A/utilities/debug_console_lite/fsl_debug_console.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2A41A/utilities/debug_console_lite/fsl_debug_console.h" projectpath="utilities"/>
        <file category="include" name="devices/K32L2A41A/utilities/str/"/>
        <file category="include" name="devices/K32L2A41A/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="notifier" Cversion="1.0.0" condition="utility.notifier.condition_id">
      <description>Utility notifier</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/utilities/fsl_notifier.c" projectpath="utilities/utilities"/>
        <file category="header" name="devices/K32L2A41A/utilities/fsl_notifier.h" projectpath="utilities/utilities"/>
        <file category="include" name="devices/K32L2A41A/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="shell" Cversion="1.0.0" condition="utility.shell.condition_id">
      <description>Utility shell</description>
      <RTE_Components_h>
#ifndef DEBUG_CONSOLE_RX_ENABLE
#define DEBUG_CONSOLE_RX_ENABLE 0
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/utilities/shell/fsl_shell.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2A41A/utilities/shell/fsl_shell.h" projectpath="utilities"/>
        <file category="include" name="devices/K32L2A41A/utilities/shell/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="str" Cversion="1.0.0" condition="utility.str.condition_id">
      <description>Utility str</description>
      <files>
        <file category="sourceC" name="devices/K32L2A41A/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2A41A/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="include" name="devices/K32L2A41A/utilities/str/"/>
      </files>
    </component>
  </components>
</package>
